## Import et préparation des données

### Fichiers csv et excel de chicago

In [434]:
import pandas as pd

df_chicago_route = pd.read_csv('../data/chicago_csv/CTA_Ridership_Daily_by_Route.csv')

C:\Users\pc\AppData\Local\Temp\ipykernel_2320\3259828267.py:3: DtypeWarning: Columns (1) have mixed types. Specify dtype option on import or set low_memory=False.
  df_chicago_route = pd.read_csv('../data/chicago_csv/CTA_Ridership_Daily_by_Route.csv')

In [435]:
df_chicago_route.head()

         date route day_type  ridership
0  2013-06-24   103        W       2325
1  2022-09-27   111        W       1777
2  2024-03-04  1001        W          9
3  2001-09-06   103        W       4976
4  2016-10-31   100        W        712

In [436]:
df_chicago_route.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1092474 entries, 0 to 1092473
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   date       1092474 non-null  object
 1   route      1092474 non-null  object
 2   day_type   1092474 non-null  object
 3   ridership  1092474 non-null  int64
dtypes: int64(1), object(3)
memory usage: 33.3+ MB

In [437]:
import pandas as pd

# Extraire l'année et le mois de df_chicago_daily
df_chicago_route['date'] = pd.to_datetime(df_chicago_route['date'])
df_chicago_route['year'] = df_chicago_route['date'].dt.year.astype(int)

In [438]:
df_chicago_route=df_chicago_route[df_chicago_route['year'] >= 2019]

In [439]:
df_chicago_route.shape

(288929, 5)

In [440]:
df_chicago_mode=pd.read_excel('../data/chicago_excel/cta-ridership-daily-boarding-totals.xlsx')

In [441]:
df_chicago_mode['service_date'] = pd.to_datetime(df_chicago_mode['service_date'])
df_chicago_mode['year'] = df_chicago_mode['service_date'].dt.year.astype(int)

df_chicago_mode=df_chicago_mode[df_chicago_mode['year'] >= 2019]

In [442]:
df_chicago_mode.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2526 entries, 6574 to 9099
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   service_date    2526 non-null   datetime64[ns]
 1   day_type        2526 non-null   object
 2   bus             2526 non-null   int64
 3   rail_boardings  2526 non-null   int64
 4   total_rides     2526 non-null   int64
 5   year            2526 non-null   int32
dtypes: datetime64[ns](1), int32(1), int64(3), object(1)
memory usage: 128.3+ KB

### Fichiers csv de Philadelphie

In [443]:
import pandas as pd

df_phil_mode = pd.read_csv('../data/philadelphia_csv/Average_Daily_Ridership_By_Mode - City of Philadelphia.csv')
df_phil_route=pd.read_csv('../data/philadelphia_csv/Average_Daily_Ridership_By_Route - City of Philadelphia.csv')

In [444]:
df_phil_mode.head()

,Calendar_Year,Calendar_Month,Mode,Average_Daily_Ridership,Source,ObjectId
0,2019,1,Bus,459160,APC,1
1,2019,1,CCT,4294,Revenue,2
2,2019,1,Heavy Rail,296709,Revenue,3
3,2019,1,Regional Rail,122856,Revenue,4
4,2019,1,Trackless Trolley,16853,APC,5

In [445]:
df_phil_mode.columns

Index(['Calendar_Year', 'Calendar_Month', 'Mode', 'Average_Daily_Ridership',
       'Source', 'ObjectId'],
      dtype='object')

In [446]:
df_phil_mode.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 492 entries, 0 to 491
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Calendar_Year            492 non-null    int64
 1   Calendar_Month           492 non-null    int64
 2   Mode                     492 non-null    object
 3   Average_Daily_Ridership  492 non-null    int64
 4   Source                   492 non-null    object
 5   ObjectId                 492 non-null    int64
dtypes: int64(4), object(2)
memory usage: 23.2+ KB

In [447]:
df_phil_route.head()

,Calendar_Year,Calendar_Month,Route,Average_Daily_Ridership,Source,ObjectId
0,2019,8,59,3811,APC,2
1,2019,8,60,8550,APC,3
2,2019,8,61,3563,APC,4
3,2019,8,62,226,APC,5
4,2019,8,64,4335,APC,6

In [448]:
df_phil_route.columns

Index(['Calendar_Year', 'Calendar_Month', 'Route', 'Average_Daily_Ridership',
       'Source', 'ObjectId'],
      dtype='object')

In [449]:
df_phil_route.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10994 entries, 0 to 10993
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Calendar_Year            10994 non-null  int64
 1   Calendar_Month           10994 non-null  int64
 2   Route                    10994 non-null  object
 3   Average_Daily_Ridership  10994 non-null  int64
 4   Source                   10994 non-null  object
 5   ObjectId                 10994 non-null  int64
dtypes: int64(4), object(2)
memory usage: 515.5+ KB

## EDA (Exploratory Data Analysis)

### Route

In [450]:
df_phil_route.head()

,Calendar_Year,Calendar_Month,Route,Average_Daily_Ridership,Source,ObjectId
0,2019,8,59,3811,APC,2
1,2019,8,60,8550,APC,3
2,2019,8,61,3563,APC,4
3,2019,8,62,226,APC,5
4,2019,8,64,4335,APC,6

In [451]:
df_chicago_route.head()

        date route day_type  ridership  year
1 2022-09-27   111        W       1777  2022
2 2024-03-04  1001        W          9  2024
6 2020-06-03    11        W        261  2020
7 2022-06-29  1001        W         65  2022
8 2023-08-04   111        W       1868  2023

#### Ajouter la colonne 'month' dans 'df_chicago_route' pour faire une comparaison mensuelle

In [452]:
df_chicago_route["month"]=df_chicago_route["date"].dt.month

#### Suppression des colonnes inutile dans df_phil_route

In [453]:
df_phil_route=df_phil_route.drop(columns=['Source', 'ObjectId'])

#### Grouper par l'année,le mois et la route pour avoir la moyenne par mois de 'ridership' dans df_chicago_route

In [454]:
df_chicago_route_monthly = (
    df_chicago_route
    .groupby(['year', 'month', 'route'], as_index=False)
    .agg({
        'ridership': 'mean'
    })
)

### Vérification des colonnes

In [455]:
df_chicago_route_monthly.columns

Index(['year', 'month', 'route', 'ridership'], dtype='object')

In [456]:
df_phil_route.columns

Index(['Calendar_Year', 'Calendar_Month', 'Route', 'Average_Daily_Ridership'], dtype='object')

#### Fusionnement de df_chicago_route_monthly et df_phil_route

In [457]:
df_chicago_route_clean = df_chicago_route_monthly.rename(columns={
    'ridership': 'avg_ridership_chicago'
})

In [458]:
df_phil_route_clean = df_phil_route.rename(columns={
    'Calendar_Year': 'year',
    'Calendar_Month': 'month',
    'Route': 'route',
    'Average_Daily_Ridership': 'avg_ridership_philadelphia'
})

In [459]:
df_route_comparison = pd.merge(
    df_chicago_route_clean,
    df_phil_route_clean,
    on=['year', 'month', 'route'],
    how='inner'
)

In [460]:
df_route_comparison.head()

   year  month route  avg_ridership_chicago  avg_ridership_philadelphia
0  2019      1     1            1587.318182                        2518
1  2019      1   103            1409.935484                        1185
2  2019      1   106             878.516129                        1191
3  2019      1   108             858.454545                        4295
4  2019      1   111            2272.806452                        1498

In [461]:
df_route_comparison.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6307 entries, 0 to 6306
Data columns (total 5 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   year                        6307 non-null   int32
 1   month                       6307 non-null   int32
 2   route                       6307 non-null   object
 3   avg_ridership_chicago       6307 non-null   float64
 4   avg_ridership_philadelphia  6307 non-null   int64
dtypes: float64(1), int32(2), int64(1), object(1)
memory usage: 197.2+ KB

In [462]:
df_route_comparison.to_csv('../data/processed/route_comparison.csv', index=False)

### Mode

In [463]:
df_chicago_mode.head()

     service_date day_type     bus  rail_boardings  total_rides  year
6574   2019-01-01        U  248879          245852       494731  2019
6575   2019-01-02        W  591006          573542      1164548  2019
6576   2019-01-03        W  664442          627781      1292223  2019
6577   2019-01-04        W  668812          628514      1297326  2019
6578   2019-01-05        A  444434          348257       792691  2019

In [464]:
df_phil_mode.head()

,Calendar_Year,Calendar_Month,Mode,Average_Daily_Ridership,Source,ObjectId
0,2019,1,Bus,459160,APC,1
1,2019,1,CCT,4294,Revenue,2
2,2019,1,Heavy Rail,296709,Revenue,3
3,2019,1,Regional Rail,122856,Revenue,4
4,2019,1,Trackless Trolley,16853,APC,5

#### les modes qu'on va comparer concerne juste 'bus' et 'rail'

In [465]:
df_phil_mode=df_phil_mode[df_phil_mode['Mode'].isin(['Bus', 'Heavy Rail', 'Regional Rail'])]

In [466]:
df_phil_mode['Mode'].unique()

array(['Bus', 'Heavy Rail', 'Regional Rail'], dtype=object)

#### Ajout de la colonne mois dans df_chicago_mode pour faire une comparaison mensuelle

In [467]:
df_chicago_mode["month"]=df_chicago_mode["service_date"].dt.month

In [468]:
df_chicago_mode.head()

     service_date day_type     bus  rail_boardings  total_rides  year  month
6574   2019-01-01        U  248879          245852       494731  2019      1
6575   2019-01-02        W  591006          573542      1164548  2019      1
6576   2019-01-03        W  664442          627781      1292223  2019      1
6577   2019-01-04        W  668812          628514      1297326  2019      1
6578   2019-01-05        A  444434          348257       792691  2019      1

#### Restructurer les colonnes de df_chicago_mode pour etre comparable avec df_phil_mode

##### Étape 1 : agrégation mensuelle (moyenne journalière)

In [469]:
df_chicago_monthly_mode = (
    df_chicago_mode
    .groupby(['year', 'month'], as_index=False)
    .agg({
        'bus': 'mean',
        'rail_boardings': 'mean'
    })
)

In [470]:
df_chicago_monthly_mode.head()

   year  month            bus  rail_boardings
0  2019      1  563028.000000   518349.838710
1  2019      2  652809.857143   584176.464286
2  2019      3  653778.935484   581263.516129
3  2019      4  664562.666667   612854.966667
4  2019      5  682092.516129   619579.677419

##### Étape 2 : passage en format long (mode)

In [471]:
df_chicago_monthly_mode = df_chicago_monthly_mode.melt(
    id_vars=['year', 'month'],
    value_vars=['bus', 'rail_boardings'],
    var_name='mode',
    value_name='ridership'
)

In [472]:
df_chicago_monthly_mode.head()

   year  month mode      ridership
0  2019      1  bus  563028.000000
1  2019      2  bus  652809.857143
2  2019      3  bus  653778.935484
3  2019      4  bus  664562.666667
4  2019      5  bus  682092.516129

#### Renommer les variables 'Heavy Rail' et 'Regional Rail' comme 'rail_boardings' dans df_phil_mode pour le comparer avec 'rail_boardings' de df_chicago_monthly_mode

In [473]:
df_phil_mode['Mode'] = df_phil_mode['Mode'].replace({
    'Heavy Rail': 'rail_boardings',
    'Regional Rail': 'rail_boardings'
})

In [474]:
df_phil_mode['Mode'] = df_phil_mode['Mode'].replace({'Bus': 'bus'})

In [475]:
df_phil_mode['Mode'].unique()

array(['bus', 'rail_boardings'], dtype=object)

#### Supprimer les dubliqués dans df_phil_mode aprer renommer les deux types de Rail juste par 'rail_boardings'

In [476]:
df_phil_mode.duplicated(subset=['Calendar_Year', 'Calendar_Month', 'Mode']).sum()

82

In [477]:
df_phil_mode=df_phil_mode.groupby(['Calendar_Year', 'Calendar_Month','Mode'], as_index=False).agg({
        'Average_Daily_Ridership': 'mean'})

In [478]:
df_phil_mode.duplicated(subset=['Calendar_Year', 'Calendar_Month', 'Mode']).sum()

0

#### Verification des colonnes

In [479]:
df_chicago_monthly_mode.columns

Index(['year', 'month', 'mode', 'ridership'], dtype='object')

In [480]:
df_phil_mode.columns

Index(['Calendar_Year', 'Calendar_Month', 'Mode', 'Average_Daily_Ridership'], dtype='object')

#### Fusionnement de df_chicago_monthly_mode et df_phil_mode

In [481]:
df_phil_mode_clean = df_phil_mode.rename(columns={
    'Calendar_Year': 'year',
    'Calendar_Month': 'month',
    'Mode': 'mode',
    'Average_Daily_Ridership': 'avg_ridership_philadelphia'
})

In [482]:
df_chicago_mode_clean = df_chicago_monthly_mode.rename(columns={
    'ridership': 'avg_ridership_chicago'
})

In [483]:
df_mode_comparison = pd.merge(
    df_chicago_mode_clean,
    df_phil_mode_clean,
    on=['year', 'month', 'mode'],
    how='inner'
)

In [484]:
df_mode_comparison.head()

   year  month mode  avg_ridership_chicago  avg_ridership_philadelphia
0  2019      1  bus          563028.000000                    459160.0
1  2019      2  bus          652809.857143                    464674.0
2  2019      3  bus          653778.935484                    478487.0
3  2019      4  bus          664562.666667                    473732.0
4  2019      5  bus          682092.516129                    480074.0

In [485]:
df_mode_comparison.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 164 entries, 0 to 163
Data columns (total 5 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   year                        164 non-null    int32
 1   month                       164 non-null    int32
 2   mode                        164 non-null    object
 3   avg_ridership_chicago       164 non-null    float64
 4   avg_ridership_philadelphia  164 non-null    float64
dtypes: float64(2), int32(2), object(1)
memory usage: 5.3+ KB

In [486]:
df_mode_comparison.to_csv('../data/processed/mode_comparison.csv', index=False)